"""
Задача 26: Напишите программу, которая на вход принимает
два числа A и B, и возводит число А в целую степень B с
помощью рекурсии.
A = 3; B = 5 -> 243 (3⁵)
A = 2; B = 3 -> 8
"""

A = 3
B = 5
def f(A, B):
    if  B == 0: 
        return 1
    return A * f(A, B-1)
print(f(A, B)) 
